#+TITLE: Devops using ORG
#+AUTHOR: Kenneth Cheung

#+PROPERTY: header-args+ :var FOOD                 = "RAMEN"
#+PROPERTY: header-args+ :var CUSTOMERS            = "DOG CAT BIRD"
#+PROPERTY: header-args+ :var REMOTE_SCRIPT_REPO   = "/tmp/Lighting-Talk-Org-Devops"
#+PROPERTY: header-args+ :var REMOTE_SCRIPT_BRANCH = "master"
#+PROPERTY: header-args+ :dir /ssh:gridfire@olympus:/tmp
#+PROPERTY: header-args+ :results output

* Motivation

- Version controlled Enviornment
- Reproducable
- Documentation and code lives in the same place

* How?
** Verify vars are set

#+begin_src bash :tangle no
echo FOOD=$FOOD
echo CUSTOMERS=$CUSTOMERS
echo REMOTE_SCRIPT_REPO=$REMOTE_SCRIPT_REPO
echo REMOTE_SCRIPT_BRANCH=$REMOTE_SCRIPT_BRANCH
#+end_src

#+RESULTS:
: FOOD=RAMEN
: CUSTOMERS=DOG CAT BIRD
: REMOTE_SCRIPT_REPO=/tmp/Lighting-Talk-Org-Devops
: REMOTE_SCRIPT_BRANCH=master

** Git Checkout & Pull Latest

#+begin_src bash
cd $REMOTE_SCRIPT_REPO
git fetch --all
git checkout $REMOTE_SCRIPT_BRANCH
git pull
COMMIT=$(git rev-parse HEAD)
echo "On branch $GRIDFIRE_SCRIPTS_BRANCH ($COMMIT)"
#+end_src

#+RESULTS:
: Fetching origin
: Your branch is behind 'origin/master' by 2 commits, and can be fast-forwarded.
:   (use "git pull" to update your local branch)
: Updating 1d53417..1569f05
: Fast-forward
:  talk.org | 78 +++++++++++++++++++++++++++++++++++++++++++---------------------
:  1 file changed, 53 insertions(+), 25 deletions(-)
: On branch  (1569f05f035f4812afeab8a21a66306d7cd13668)

** Pass ORG variables to remote procces

#+begin_src bash :exports code :padline no :no-expand :results verbatim
sh $REMOTE_SCRIPT_REPO/remote-script.sh $FOOD
#+end_src

#+RESULTS:
: Launch remote script!
: Constructing RAMEN

** Inject code blocks into another

- must set :noweb yes in either the top level header-args or source code block's header

#+begin_src bash :export code :tangle tangle/serve-ramen.sh :padline no :no-expand :noweb yes
#!/bin/bash

<<make-noodles>>

<<make-stock>>

<<assemble-ramen>>

for CUSTOMER in $CUSTOMERS; do
    make-noodles
    make-stock
    assemble-ramen $CUSTOMER
done
N=$(echo $CUSTOMERS | wc -w)
python - $N <<-END
<<compute-bill-py>>
END
#+end_src

#+RESULTS:
#+begin_example
Mix flour and sodium bicarbonate together ...
Add kombu and katsuboshi into a pot of chicken stock
Making ramen for DOG
Mix flour and sodium bicarbonate together ...
Add kombu and katsuboshi into a pot of chicken stock
Making ramen for CAT
Mix flour and sodium bicarbonate together ...
Add kombu and katsuboshi into a pot of chicken stock
Making ramen for BIRD
Your bill is $59.97
#+end_example

*** steps
**** make-noodles

say something about noodles

#+name: make-noodles
#+begin_src bash
function make-noodles {
    echo "Mix flour and sodium bicarbonate together ..."
}
#+end_src

**** make-stock

say something about dashi

#+name: make-stock
#+begin_src bash
function make-stock {
    echo "Add kombu and katsuboshi into a pot of chicken stock"
}
#+end_src

**** make-ramen
#+name: assemble-ramen
#+begin_src bash
function assemble-ramen {
    echo "Making ramen for $1"
}
#+end_src

**** compute-bill

#+name: compute-bill-py
#+begin_src python
#!/usr/bin/python
import sys

n = sys.argv[1]

bill = 19.99 * int(n)

print ('Your bill is $' + str(bill))
#+end_src
